In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [6]:
df = pd.read_csv('cleaned_ages_dataset.csv')
df.head()

,Name,Gender,Occupation,Birth year,Death year,Manner of death,Age of death,Associated Countries,Associated Country Life Expectancy,AOD_Category,Gender Grouped
0,douglas adams,['male'],artist,1952,2001,natural causes,49,['united kingdom'],[81.3],41-50,male
1,abraham lincoln,['male'],politician,1809,1865,homicide,56,['united states'],[78.5],51-60,male
2,paul morand,['male'],artist,1888,1976,NaN,88,['france'],[82.5],81-90,male
3,claude monet,['male'],artist,1840,1926,natural causes,86,['france'],[82.5],81-90,male
4,elvis presley,['male'],artist,1935,1977,natural causes,42,['united states'],[78.5],41-50,male

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 742532 entries, 0 to 742531
Data columns (total 11 columns):
 #   Column                              Non-Null Count   Dtype
---  ------                              --------------   -----
 0   Name                                742532 non-null  object
 1   Gender                              666992 non-null  object
 2   Occupation                          684916 non-null  object
 3   Birth year                          742532 non-null  int64
 4   Death year                          742532 non-null  int64
 5   Manner of death                     43779 non-null   object
 6   Age of death                        742532 non-null  int64
 7   Associated Countries                742532 non-null  object
 8   Associated Country Life Expectancy  742304 non-null  object
 9   AOD_Category                        742532 non-null  object
 10  Gender Grouped                      742532 non-null  object
dtypes: int64(3), object(8)
memory usage: 62.3+ MB